Autodesk.Revit.DB.ExternalData.CoordinationModelLinkPathType
Since:
2026.3
An enumerated type representing the options for the path type of a Coordination Model.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkPathType.Cloud
The Coordination Model has a cloud source path.

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkPathType.Relative
The Coordination Model has a local relative path on disk.

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkPathType.Absolute
The Coordination Model has a local absolute path on disk.